examples/pingreply.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://www.oasis-open.org/committees/ebxml-msg/schema/envelope.xsd" xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd">
  <soap-env:Header>
    <eb:MessageHeader xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd" soap-env:mustUnderstand="1" eb:version="2.0">
      <eb:From>
        <eb:PartyId eb:type="zz">Someone_else</eb:PartyId>
      </eb:From>
      <eb:To>
        <eb:PartyId eb:type="zz">phineas</eb:PartyId>
      </eb:To>
      <eb:CPAId>phineas.phinms270sp1</eb:CPAId>
      <eb:ConversationId>1314287463609</eb:ConversationId>
      <eb:Service>urn:oasis:names:tc:ebxml-msg:service</eb:Service>
      <eb:Action>Pong</eb:Action>
      <eb:MessageData>
        <eb:MessageId>1314287468078@cdc.gov</eb:MessageId>
        <eb:Timestamp>2011-08-25T10:51:08</eb:Timestamp>
        <eb:RefToMessageId>11197543@phineas.us</eb:RefToMessageId>
      </eb:MessageData>
    </eb:MessageHeader>
  </soap-env:Header>
  <soap-env:Body>
    <eb:Manifest xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd" eb:version="2.0">
      <eb:Reference xlink:href="cid:statusResponse@cdc.gov" xlink:type="simple"/></eb:Manifest>
  </soap-env:Body>
</soap-env:Envelope>